# Задание 4:
# Вывести на экран таблицу умножения от 1 до 10 с помощью двух циклов for.

for a in range(1, 11):
    for b in range(1, 11):
        print(f'{a}*{b}={a * b}')
